; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v10 ?v9)
             (pred_4 ?v3 ?v11)
             (pred_6 ?v10 ?v11)
             (pred_10 ?v8 ?v10 )
	     (pred_12 ?v10)
             (pred_2 ?v13)
             (pred_5 ?v3)
             (pred_8 ?v11)
             (pred_9 ?v10)
             (pred_11 ?v3)
             (pred_7 ?v10)
             (pred_3 ))



(:action op_1
:parameters (?v5 ?v7 ?v6 ?v12)
:precondition (and (pred_2 ?v5) (pred_2 ?v7) (pred_5 ?v6) (pred_8 ?v12)
          (pred_1 ?v5 ?v7) (pred_4 ?v6 ?v12)
                   (pred_6 ?v7 ?v12) (pred_12 ?v5) 
                   (pred_9 ?v7) (pred_11 ?v6))
:effect (and  (pred_7 ?v7) (not (pred_9 ?v7))))


(:action op_5
:parameters (?v5 ?v2)
:precondition (and (pred_2 ?v5) (pred_2 ?v2)
               (pred_12 ?v5) (pred_1 ?v5 ?v2) (pred_7 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v5))))

(:action op_4
:parameters (?v5 ?v6)
:precondition (and (pred_2 ?v5) (pred_5 ?v6) 
                  (pred_12 ?v5) (pred_10 ?v6 ?v5) (pred_3 ))
:effect (and (pred_11 ?v6)
   (not (pred_10 ?v6 ?v5)) (not (pred_3 ))))


(:action op_3
:parameters (?v5 ?v1 ?v4)
:precondition (and (pred_2 ?v5) (pred_5 ?v1) (pred_5 ?v4)
                  (pred_12 ?v5) (pred_11 ?v4) (pred_10 ?v1 ?v5))
:effect (and (pred_11 ?v1) (pred_10 ?v4 ?v5)
        (not (pred_11 ?v4)) (not (pred_10 ?v1 ?v5))))

(:action op_2
:parameters (?v5 ?v6)
:precondition (and (pred_2 ?v5) (pred_5 ?v6) 
                  (pred_12 ?v5) (pred_11 ?v6))
:effect (and (pred_3 ) (pred_10 ?v6 ?v5) (not (pred_11 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_05 obj_04 obj_15 obj_02 obj_03 obj_10 obj_01 obj_19 obj_08 obj_06 obj_18 obj_21 obj_07 obj_16 obj_11
    obj_13 obj_14
    obj_20 obj_12 obj_09
    )

    (:init
       (pred_3)

       (pred_2 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_04)
       (pred_2 obj_15)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_10)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_08)
       (pred_2 obj_06)
       (pred_2 obj_18)
       (pred_2 obj_21)
       (pred_2 obj_07)
       (pred_2 obj_16)
       (pred_2 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_14)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_09)

       (pred_1 obj_17 obj_02)
       (pred_1 obj_17 obj_05)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_05 obj_17)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_04 obj_15)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_15 obj_04)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_02 obj_03)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_10)
       (pred_1 obj_03 obj_05)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_02)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_08 obj_06)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_06 obj_18)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_18 obj_06)
       (pred_1 obj_21 obj_07)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_07 obj_16)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_07 obj_21)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_07)
       (pred_1 obj_11 obj_18)
       (pred_1 obj_11 obj_16)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_21)
       (pred_6  obj_17 obj_13)
       (pred_6  obj_03 obj_14)
       (pred_6  obj_21 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_04)
       (pred_7 obj_15)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_01)
       (pred_7 obj_19)
       (pred_7 obj_08)
       (pred_7 obj_06)
       (pred_7 obj_18)
       (pred_7 obj_07)
       (pred_7 obj_16)
       (pred_7 obj_11)

       (pred_4  obj_20 obj_13)
       (pred_4  obj_12 obj_14)
       (pred_4  obj_09 obj_14)
       (pred_10 obj_20 obj_11)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_09 obj_01)
       (pred_12 obj_19)
    )

    (:goal (and
       (pred_10 obj_12 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_03)))
)
)

; plan
1. (op_4 obj_19 obj_12)
   deleted: (pred_10 obj_12 obj_19) (pred_3)
   added: (pred_11 obj_12)
   goals met: 0 of 1
2. (op_5 obj_19 obj_08)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_06)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_06)
   goals met: 0 of 1
4. (op_5 obj_06 obj_10)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_10)
   goals met: 0 of 1
5. (op_5 obj_10 obj_04)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_04)
   goals met: 0 of 1
6. (op_5 obj_04 obj_05)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_05)
   goals met: 0 of 1
7. (op_2 obj_05 obj_12)
   deleted: (pred_11 obj_12)
   added: (pred_3) (pred_10 obj_12 obj_05)
   goals met: 1 of 1
